
<template>
  <div class="service-popup">
    <popup v-model="isShowPop" height="100%" @on-hide="hidenPop">
      <div class="serviceTerms" style="width:100%;">
          <div class="header">
            <nav-header title="用户注册协议和隐私政策" :showBack='false'>
            </nav-header>
            <i class="iconfont icon-close service-colose" @click="closePop"></i>
          </div> 
          <div class="service-container">
            <vue-better-scroll class="service-content" ref="scroll">
              <div class="service-list">
                <h3 class="list-title">1. 服务条款的接受</h3>
                <p>
                  ①使用或注册本软件账号即表明您确认同意这些条款。 如果您不同意本服务条款及/或随时对其的修改，您应不 使用或主动取消大嘴龙英语提供的服务。您的使用行为将被 视为您对本服务条款全部的接受，包括接受大嘴龙英语对服 务条款随时所做的任何修改。
                </p>
                <p>
                ②大嘴龙英语将不断推出新的服务，本服务条款适用于大嘴龙英语提 供的所有服务，但当您使用大嘴龙英语某一特定服务时，如该服 务另有单独的服务条款、指引或规则，您应遵守本服务条款 及大嘴龙英语随时公布的与该服务相关的服务条款、指引或规则等 。前述所有的指引和规则，均构成本服务条款的一部分。除非本 服务条款另有 其它明示规定，新推出的产品或服务、增加或强化目 前本服务的任何新功能，均受到本服务条款的规范。
                </p>
                <h3 class="list-title">2. 服务条款的修改</h3>
                
                <p>大嘴龙英语有权在必要时修改本服务条款, 服务条款一旦发生变动，将会在相关 页面上公布修改后的服务条款。如果不同意所改动的条款，用户应主动 取消使用大嘴龙英语为您提供的服务。如果用户继续使用本软件，则视为接 受服务条款的变动。
                </p>
                
                <h3 class="list-title">3. 服务说明</h3>
                
                <p>
                ①用户应自行配备手机或其它移动上网必备装置，自行负担APP上网所需支付的与此服务有关的网络及流量费用。
                </p>
                <p>

                ②不得使用本服务上载、传输或采用其它方式分发任何非法的、诽谤性的、侵扰他人的、侮辱性的、欺诈性的、猥亵的、包含病毒的或根据我公司的合理判断会在其它方面遭反对的任何内容。
                </p>
                <p>

                ③不得上载、传输或采用其它方式分发侵犯其它一方的知识产权或者其它专有、契约或信用权利或义务的内容；不得将这一服务用于任何欺诈或不当目的；未经他人同意而提取或以其它方式收集有关他人的信息，包括电子邮件地址。
                </p>
                <p>

                ④保证妥善保管好大嘴龙英语平台的帐号及相关密码，如果造成帐户信息失密，由此给您带来的损失，均由您自己承担。您应对任何人利用您的账户信息所进行的活动负完全的责任，大嘴龙英语无法对非法或未经您授权使用您的账户信息的行为作出甄别，因此大嘴龙英语不承担任何责任。
                </p>
                <p>

                ⑤用户同意接受大嘴龙英语或大嘴龙英语与第三方合作通过大嘴龙英语平台或其它合法方式向用户发送商品促销或其他相关商业信息。
                </p>

                <h3 class="list-title">4.关于收费服务</h3>
                
                <p>

                ①大嘴龙英语推出的大嘴龙英语平台的增值服务可以以收费方式提供。资费说明标明在大嘴龙英语相应服务的相应页面上。如果用户选择这些增值服务，用户应按有关的收费标准、付款方式支付相关服务费及其它费用。
                </p>
                <p>

                ②依本服务条款所取得的服务权利不可转让。
                </p>
                <p>

                ③如用户违反国家法律法规或本服务条款，大嘴龙英语将有权停止向用户提供服务而不需承担任何责任，如导致今目标遭受任何损害或遭受任何来自第三方的纠纷、诉讼、索赔要求等，用户须向大嘴龙英语赔偿相应的损失，并需对其违反服务条款所产生的一切后果负全部法律责任。
                </p>
                <h3 class="list-title">5. 服务风险及免责声明</h3>
                
                <p>

                ①用户须明白，本服务涉及到互联网及移动通讯等服务，鉴于移动设备及互联网的特殊性，因黑客、病毒、Internet上通路的阻塞、电信部门技术 或政策调整或大嘴龙英语为进行服务器配置、维护等造成的服务中断或不能满足用户要求的风险。开通服务的用户须承担以上风险，大嘴龙英语对服务的及时性、安全性、准确性不作担保，对因此导致用户不能发送和接受阅读消息、或传递错误，个人设定的时效、未予储存或其它问题不承担任何责任。
                </p>
                <p>

                ②如本公司的系统发生故障影响到本服务的正常运行，本公司承诺在第一时间内及时处理进行修复。但用户因此而产生的经济损失，大嘴龙英语不承担责任。此外，大嘴龙英语保留不经事先通知为维修保养、升级或其它目的暂停本服务的权利。
                </p>
                <p>

                ③大嘴龙英语郑重提请您注意，任何经由本服务上传的文字、音频、音讯、照片、视讯、信息、用户的登记资料或其他资料（以下简称“内容”），均由内容提供者承担责任。
                </p>
                <p>

                ④关于使用及储存的一般措施：您承认关于本服务的使用，大嘴龙英语服务器有权为您分配最大的储存空间。通过本服务存储或传送的任何信息、通讯资料和其它内容，如被删除或未予储存，您同意大嘴龙英语毋须承担任何责任。您亦同意，长时间未使用的帐号，大嘴龙英语有权关闭并收回帐号。您也同意，大嘴龙英语有权根据情况，不论通知与否，随时变更这些一般措施及限制。
                </p>
                <p>

                ⑤本服务可提供与其它网站平台的链接。由于大嘴龙英语无法控制这些网站，您了解并同意：无论此类网站是否可供利用，大嘴龙英语不予负责；大嘴龙英语亦对此类网站的任何内容、广告、产品或其他资料不予保证或负责。因您使用或依赖任何此类网站发布的或经由此类网站获得的任何内容、商品或服务所产生的任何损害或损失， 大嘴龙英语不负任何直接或间接的责任。
                </p>
                <p>

                ⑥大嘴龙英语短信的发送，受各种大嘴龙英语以外的因素控制，如果发生短信延迟、短信丢失现象，我公司不承担任何责任。
                </p>
                <h3 class="list-title">6. 用户隐私制度</h3> 
                <p>
                ①大嘴龙英语重视对用户隐私的保护，保护隐私是大嘴龙英语的一项基本政策。您提供的注册资料及今目标公司保留的有关您的若干其他资料将受到中国有关隐私的法律和本公司《隐私声明》的规范。
                </p>
                <p>②大嘴龙英语不会在未经合法用户授权时，公开、编辑或透露其信息及保存在大嘴龙英语平台中的非公开内容，除非有下列情况： 
                1.有关法律规定或大嘴龙英语合法服务程序规定； 
                2.在紧急情况下，为维护用户及公众的权益； 
                3.为维护大嘴龙英语的知识产权和其他重要权利； 
                其它需要公开、编辑或透露用户信息的情况。
                </p>
                <h3 class="list-title">7.保密协议</h3>
                <h4 class="list-title">1. 保密的内容和范围</h4>
                <p>
                  ①涉及用户的信息，仅限于用户使用大嘴龙英语管理软件系统保存在大嘴龙英语服务器上的数据。 
                </p>
                <p>
                  ②凡以直接、间接、口头或书面等形式提供涉及保密内容的行为均属泄密。
                </p>
                <h4 class="list-title">2. 双方的权利与义务、责任</h4>
                <p>
                  ①大嘴龙英语应自觉维护用户的利益，严格遵守本保密协议的保密规定。
                </p>
                <p>
                  ②大嘴龙英语不得随意向任何单位和个人泄露用户的任何资料信息。
                </p>
                <p>
                  大嘴龙英语了解并承认，通过系统用户会将具有商业价值的资料（保密信息）保存于大嘴龙英语管理软件的服务器上，并且由于技术服务等原因，大嘴龙英语有可能在某些情况下访问这些数据。大嘴龙英语同意并承诺，未经用户许可不披露给他人
                </p>
                <h4 class="list-title">
                  本《协议》项下的保密义务不适用于如下信息：
                </h4>
                <p>
                  ①非由于大嘴龙英语的原因已经为公众所知的。
                </p>
                <p>
                  ②由于大嘴龙英语以外其他渠道被他人获知的信息，这些渠道并不受保密义务的限制。
                </p>
                <p>
                  ③由于法律的适用、法院或其他国家有权机关的要求而披露的信息。
                </p>
                <h3 class="list-title">8. 法律</h3>
                <p>
                  ①本条款适用中华人民共和国的法律，并且排除一切冲突法规定的适用。
                </p>
                <p>
                  ②如出现纠纷，用户和大嘴龙英语一致同意将纠纷交由郑州市金水区人民法院管辖。
                </p>
                <h3 class="list-title">9. 其它</h3>
                <p>
                  ①如本服务条款中的任何条款无论因何种原因完全或部分无效或不具有执行力，本服务条款的其余条款仍应有效且具有约束力。
                </p>
                <p>
                  ②本服务条款构成您与大嘴龙英语的全部协议，规范您对本服务的使用，并取代您先前与大嘴龙英语达成的全部协议。
                </p>
                <p class="serviceOver">大嘴龙英语保留本服务条款的解释权。</p>
              </div>
            </vue-better-scroll>
          </div>          
        </div>
    </popup>
  </div>
</template>

<script>
import { Popup, Group } from "vux";
import navHeader from "@/components/navHeader";
export default {
  props: ['showPopUp'],
  name:"servicePopUp",
  data() {
    return {
      isShowPop:null,
    };
  },
  watch: {
    showPopUp(val){
      this.isShowPop = val;
      this.$refs.scroll && this.$refs.scroll.forceUpdate(true);
    }
  },
  methods: {
    hidenPop:function(){
      this.$emit('update:showPopUp', false);
    },
    closePop:function(){
      this.isShowPop=false;
    } 
  },
  components: {
    navHeader,
    Popup,
  }
};
</script>

<style lang="scss">
@import "~@/assets/css/variables";
.clearfix:after {
  content: "";
  display: table;
  clear: both;
  overflow: hidden;
}
.header {
  position: fixed;
  top: 0;
  left: 0;
  right: 0;
  z-index: 10;
}
.service-container {
  position: fixed;
  top: 110px;
  left: 0;
  right: 0;
  bottom: 0;
  padding: 10px;
  background:$bg-color;
  font-size:$normal-font-size;
  color:$body-text-color;
  overflow: hidden;
  .service-content {
    height: 100%;
    .service-list {
      list-style: none;
      padding:$padding 0;
      >p{
        padding:$padding/2 0;
        text-indent:2em;
      }
    }
  }
  .list-title{
    color:$emphases-text-color;
  }
  .serviceOver{
    font-weight:bold;
    color:$emphases-text-color;
  }
  
}
.service-colose{
  display:block;
  position: absolute;
  top:35px;
  left:25px;
  font-size:$large-font-size;
  color:$nav-color;
}

</style>
